# Pandas Groupby on multiple columns

Multiple columns in pandas dataframe can be grouped together by using pandas `groupby()` function.

## How to use pandas groupby on multiple columns using dictionary

Steps to perform multi-column groupby with dictionary are -

* Creating a dataframe.
* Creating a dictionary having setup of columns on which groupby operation should be performed.
* Performing groupby operation using aggregate functions like `sum()`, `min()`, `max()` etc.

In this article, you will learn how to combine multiple columns in dataframe by using pandas groupby with dictionary.

Let's create a dataframe first.

In [ ]:
# Import Library
import pandas as pd

# Step 1: Create Dataframe
data = pd.DataFrame({'Brand':['Tesla','BMW','Ferrari','Ford'],
                      'Mon':[100,150,50,40],
                      'Tue':[48,29,90,43],
                      'Wed':[43,57,49,34],
                      'Thr':[94,84,64,31]})

# Step 2: Creating Dictionary
dict = { 
    'Brand':'Brand',
    'Mon':'Total_Cars_Sold',
    'Tue':'Total_Cars_Sold',
    'Wed':'Total_Cars_Sold',
    'Thr':'Total_Cars_Sold'}

data

     Brand  Mon  Tue  Wed  Thr
0    Tesla  100   48   43   94
1      BMW  150   29   57   84
2  Ferrari   50   90   49   64
3     Ford   40   43   34   31

## Applying Pandas Groupby

Let's see the syntax of groupby function.

### pandas.dataframe.groupby()

__DataFrame.groupby(by=None, axis=0, level=None, as_index=True, sort=True, group_keys=True, squeeze=NoDefault.no_default, observed=False, dropna=True)__


__Purpose:__ involves splitting of the object, applies a function and then combines the results. It can be used to group large amount of data.

__Parameters:__

__- by:__ mapping, label, list of labels.

 __- axis:__ 0 or ‘index’ applies function to each column. 1 or ‘columns’ applies function to each row.

 __- level:__ if the axis is a multi-index, then group by a particular level.

 __- as_index:__ object with group labels as the index is returned.

 __- sort:__ sort the group keys.

 __- group_keys:__ add group keys to index.

 __- squeeze:__ to reduce the dimensionality of the return type.

 __- observed:__ only applicable if any of the groupers are categorical.

 __- dropna:__ if `True`, and if group keys contain `NA` values then `NA` values are omitted.

In [ ]:
# Step 3: Applying data.groupby
data.groupby(dict, axis = 1).sum()

     Brand  Total_Cars_Sold
0    Tesla              285
1      BMW              320
2  Ferrari              253
3     Ford              148

* Pandas group by is used to divide data into groups and get meaningful results from grouped data by using aggregate functions on it.

* `sum()` function is used to perform sum of values on a group of data.

## 1.Groupby using dictionary to get total number of cars sold for each brand in first two days and last two days

In [ ]:
dict = {'Brand':'Brand',
    'Mon':'Initial_2_Days',
    'Tue':'Initial_2_Days',
    'Wed':'Last_2_Days',
    'Thr':'Last_2_Days'}
    
data.groupby(dict, axis = 1).sum()

     Brand  Initial_2_Days  Last_2_Days
0    Tesla             148          137
1      BMW             179          141
2  Ferrari             140          113
3     Ford              83           65

Here, using 'initial_2_days' and 'last_2_days' one can interpret that one can group together columns with same properties.

## 2.Groupby using dictionary to get minimum number of cars sold for each brand

In [ ]:
dict = {'Mon':'Least_Count',
   'Tue':'Least_Count',
   'Wed':'Least_Count',
   'Thr':'Least_Count'}

data = data.set_index('Brand')
data.groupby(dict, axis = 1).min()

         Least_Count
Brand
Tesla             43
BMW               29
Ferrari           49
Ford              31

`min()` finds the minimum value from group of values for specific brand for all days.

## 3.Groupby using dictionary to get maximum number of cars sold for each brand

In [ ]:
dict = {'Mon':'Max_Count',
   'Tue':'Max_Count',
   'Wed':'Max_Count',
   'Thr':'Max_Count'}
   
data.groupby(dict, axis = 1).max()

         Max_Count
Brand
Tesla          100
BMW            150
Ferrari         90
Ford            43

`max()` finds maximum value from group of values for specific brand for all days.

## 4.Practical Tips 

* Make sure you use `set_index` for columns like 'Brand' here.
* Try using several aggregate functions with groupby on multiple columns combined together.

## 5.Test Your Knowledge 

__Q1.__ Pandas grouby can be used only on one column. True or False ?

__Ans.__ False, one can use groupby for multiple columns.



__Q2.__ List out any 5 aggregate functions that can be used along with group by in pandas ?

__Ans.__ Five aggregate functions that can be used along with groupby are -
`mean()`, `sum()`, `count()`, `min()` and `max()`.



__Q3.__ Sam is a guy who makes some silly mistakes always, he has written the following code and wants you to help him to spot missing code in it so that he can get total cars sold by each brand.

In [ ]:
import pandas as pd

data=pd.DataFrame({'Brand':['Tesla','BMW','Ferrari','Ford'],
                   'Mon':[100,150,50,40],
                   'Tue':[48,29,90,43],
                   'Wed':[43,57,49,34],
                   'Thr':[94,84,64,31]})

d = {'Brand':'Brand',
     'Mon':'Total_Cars_Sold',
     'Tue':'Total_Cars_Sold',
     'Wed':'Total_Cars_Sold',
     'Thr':'Total_Cars_Sold'}

data.groupby(d).sum()

Empty DataFrame
Columns: [Mon, Tue, Wed, Thr]
Index: []

__Ans.__ The code should be like ```data.groupby(d, axis = 1).sum()```

In [ ]:
data.groupby(d, axis = 1).sum()

     Brand  Total_Cars_Sold
0    Tesla              285
1      BMW              320
2  Ferrari              253
3     Ford              148